updateMetadata.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<met:SessionHeader>
			<met:sessionId>?</met:sessionId>
		</met:SessionHeader>
	</soapenv:Header>
	<soapenv:Body>
		<met:updateMetadata xmlns="http://soap.sforce.com/2006/04/metadata">
			<records xsi:type="Profile">
				<fullName>Admin</fullName>
				<layoutAssignments>
					<layout>sfternd__Bob__c-Bob v3</layout>
					<recordType>sfternd__Bob__c.Bob1</recordType>
				</layoutAssignments>
			</records>
		</met:updateMetadata>
	</soapenv:Body>
</soapenv:Envelope>